app/Controllers/Home.php

SELECT *
FROM `users`
---
    public function listing()
    {
        $userModel = new UserModel();
       $response['data']= $userModel->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = 'kavu@mailinator.com'
---
    public function postform()
    {
        $userModel = new UserModel();
        $data = [
            'first_name'       => $this->request->getVar('first_name'),
            'last_name'        => $this->request->getVar('last_name'),
            'mobile'        => $this->request->getVar('mobile'),
            'email'        => $this->request->getVar('email'),
        ];

        $email = $this->request->getVar('email');
        $response['data']= $userModel->find($email);

SELECT *
FROM `users`
WHERE `id` = '88'
 LIMIT 1
---
    public function getform($id=null)
    {
      if($id != null){
        $userModel = new UserModel();
        $response['data'] = $userModel->where('id', $id)->first();

DELETE FROM `users`
WHERE `id` = '91'
AND `id` IN ('91')
---
    public function delete($id)
    {

        $userModel = new UserModel();
        $response['user'] = $userModel->where('id', $id)->delete($id);